In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [13]:
df=pd.read_csv('C:/Users/sande/Desktop/Python_Basic _Project/Data_Analysis_Project/Dipwali_Analysis_project/Diwali_selse.csv')
print(df.head())
# df.head(10)
df.shape

   User_ID  Cust_name Product_ID Gender Age Group  Age  Marital_Status  \
0  1002903  Sanskriti  P00125942      F     26-35   28               0
1  1000732     Kartik  P00110942      F     26-35   35               1
2  1001990      Bindu  P00118542      F     26-35   35               1
3  1001425     Sudevi  P00237842      M      0-17   16               0
4  1000588       Joni  P00057942      M     26-35   28               1

            State      Zone       Occupation Product_Category  Orders  \
0     Maharashtra   Western       Healthcare             Auto       1
1  Andhraï¿½Pradesh  Southern             Govt             Auto       3
2   Uttar Pradesh   Central       Automobile             Auto       3
3       Karnataka  Southern     Construction             Auto       2
4         Gujarat   Western  Food Processing             Auto       2

    Amount  Status  unnamed1
0  23952.0     NaN       NaN
1  23934.0     NaN       NaN
2  23924.0     NaN       NaN
3  23912.0     NaN       NaN
4  23877.0     NaN       NaN

(11251, 15)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           11251 non-null  int64
 1   Cust_name         11251 non-null  object
 2   Product_ID        11251 non-null  object
 3   Gender            11251 non-null  object
 4   Age Group         11251 non-null  object
 5   Age               11251 non-null  int64
 6   Marital_Status    11251 non-null  int64
 7   State             11251 non-null  object
 8   Zone              11251 non-null  object
 9   Occupation        11251 non-null  object
 10  Product_Category  11251 non-null  object
 11  Orders            11251 non-null  int64
 12  Amount            11239 non-null  float64
 13  Status            0 non-null      float64
 14  unnamed1          0 non-null      float64
dtypes: float64(3), int64(4), object(8)
memory usage: 1.3+ MB

In [16]:
df.drop(['Status','unnamed1'],axis=1,inplace=True)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           11251 non-null  int64
 1   Cust_name         11251 non-null  object
 2   Product_ID        11251 non-null  object
 3   Gender            11251 non-null  object
 4   Age Group         11251 non-null  object
 5   Age               11251 non-null  int64
 6   Marital_Status    11251 non-null  int64
 7   State             11251 non-null  object
 8   Zone              11251 non-null  object
 9   Occupation        11251 non-null  object
 10  Product_Category  11251 non-null  object
 11  Orders            11251 non-null  int64
 12  Amount            11239 non-null  float64
dtypes: float64(1), int64(4), object(8)
memory usage: 1.1+ MB

In [20]:
pd.isnull(df).sum()

User_ID              0
Cust_name            0
Product_ID           0
Gender               0
Age Group            0
Age                  0
Marital_Status       0
State                0
Zone                 0
Occupation           0
Product_Category     0
Orders               0
Amount              12
dtype: int64

In [23]:
df.shape

(11239, 13)

In [24]:
df.dropna(inplace=True)
df.shape

(11239, 13)

Initialize list of Lists

In [28]:
data_test=[['Mahadev','Mumbai',1000,5000],['Sandeep','Pune',2000,6000],['Rahul','Nagpur',],['Rajesh','Nashik',4000,8000],['Raj','Thane',5000,9000]]
df_test=pd.DataFrame(data_test,columns=['Name','City','Income','Expenditure'])
df_test

      Name    City  Income  Expenditure
0  Mahadev  Mumbai  1000.0       5000.0
1  Sandeep    Pune  2000.0       6000.0
2    Rahul  Nagpur     NaN          NaN
3   Rajesh  Nashik  4000.0       8000.0
4      Raj   Thane  5000.0       9000.0

In [30]:
df_test.dropna()

      Name    City  Income  Expenditure
0  Mahadev  Mumbai  1000.0       5000.0
1  Sandeep    Pune  2000.0       6000.0
3   Rajesh  Nashik  4000.0       8000.0
4      Raj   Thane  5000.0       9000.0

In [31]:
df_test

      Name    City  Income  Expenditure
0  Mahadev  Mumbai  1000.0       5000.0
1  Sandeep    Pune  2000.0       6000.0
2    Rahul  Nagpur     NaN          NaN
3   Rajesh  Nashik  4000.0       8000.0
4      Raj   Thane  5000.0       9000.0

In [33]:
df_test.dropna(inplace=True)
df_test

      Name    City  Income  Expenditure
0  Mahadev  Mumbai  1000.0       5000.0
1  Sandeep    Pune  2000.0       6000.0
3   Rajesh  Nashik  4000.0       8000.0
4      Raj   Thane  5000.0       9000.0